docs: switch call-flow to mermaid
